### Pandas
* DataFrame 클래스
* Series 클래스

In [ ]:
import pandas as pd

#### read.csv() : csv 파일을 읽어서 DataFrame 객체로 생성함

In [ ]:
'''
Survied --> 0이면 사망, 1이면 생존 -> int64
Pclass -> 티켓 등급 : 1,2,3*int64
Name -> 승객이름 : Surname, Title. Firstname -> object
Sex -> 성별 : male, female -> object
Age -> 승객의 나이 -> float64
Sibsp -> 형제, 자매, 배우자의 합 -> int64
Parch -> 부모, 자식의 합 -> int64
Ticket -> 티켓의 번호 -> object
Fare -> 요금 float64
Cabin -> 객실의 번호 -> object
Embarked -> 선착장 : C(Cherbourg), Q(Queenstown), S(southampton) -> object
'''

In [ ]:
titanic_df = pd.read_csv("titanic_train.csv")
print("titanic 변수 타입:", type(titanic_df))

* head() 메소드
* DataFrame 의 상위 5개의 data를 추출함

In [ ]:
titanic_df.head(5)

In [ ]:
titanic_df.head(10)

* dictionary 에 있는 data를 DataFrame 으로 변환하기
* DataFrame 객체를 생성하면서 argument로 dictionary를 지정해 주면됨

In [ ]:
dict1 = {"name":["이순신", "안중근", "유관순", "글로벌"],
         "birth":[1545, 1879, 1901, 2010],
         "gender":["남자", "여자", "여자", "여자"]
         }
info_df = pd.DataFrame(dict1)
print(dict1["name"])
info_df

In [ ]:
# 컬럼명 추가하기
info_df = pd.DataFrame(dict1, columns = ["name", "birth", "gender", "age"])
info_df

In [ ]:
# 인덱스명 설정하기
info_df = pd.DataFrame(dict1, index=["one", "two", "three", "four"])
info_df

* DataFrame의 column 명 / index

In [ ]:
# titanic_df
print("columns:\n", titanic_df.columns)

In [ ]:
print("index:\n",titanic_df.index)

In [ ]:
# 0 ~ 890
print("index 값:\n", titanic_df.index.values)

### Series
* DataFrame 에서 Series 추출하기

In [ ]:
series_name = titanic_df["Name"]
series_name
series_name.head()

In [ ]:
#DataFrame 에서 [] 속에 컬럼명 두 개를 지정해서 DataFrame로 추출하기
#                          ㄴ [컬럼명][("Name")]로 지정
df_name = titanic_df[["Name"]]
df_name
df_name.head()
print("df_name:", type(df_name))
df_name.head()

In [ ]:
# DataFrame 에서 [] 속에 컬럼명 두 개를 지정해서 DataFrame 로 추출하기
#                          ㄴ ["컬럼명", "컬럼명"][("Name", "Age")]로 지정
df_name = titanic_df[["Name", "Age"]]
df_name
df_name.head()
print("df_name:", type(df_name))
df_name.head()

* shape : DataFrame 의 행(row)과 열(column)을 알려줌

In [ ]:
print("titanic_df의 shape:", titanic_df.shape)

* info() 메소드 : DataFrame 의 data 건수(행의 개수), 컬럼 개수, 컬럼 이름,
데이터 타입, Null(결측치), 건수

In [ ]:
titanic_df.info()

* describe() 메소드 : 데이터값들의 개수(count), 평균(mean), <br>표준편차(std) 4분위 분포도(최저값, 25%, 50%, 75%, 최고값)을 제공함

In [ ]:
titanic_df.describe()

* value_counts() 메소드 : 같은 데이터값들이 몇 건 있는지 정보를 제공해 줌
* ㄴ 개별 데이터 값들의 분포도를 알 수 있음
* DataFrame 클래스의 메소드가 아니고, Series 클래스의 메소드이기 때문에
* DataFrame 에서 Series 를 추출해서 호출해야 함

In [ ]:
value_counts = titanic_df["pclass"].value_counts()
print("value_counts:\n",value_counts,sep="")
print("titanic_df[\"Pclass\"]의 타입:", type(titanic_df["Pclass"]))

In [ ]:
#seies
titanic_df["Pclass"].head()

* sort_values() 메소드 (DataFrame 클래스의 메소드) : 원본이 변형되지 않고 정렬된 새로운 DataFrame 객체를 생성함
* parameter : by=정렬할 컬럼, ascending=True(오름차순)/False(내림차순)

In [ ]:
titanic_df.head()

In [ ]:
titanic_df.sort_values(by="Pclass", ascending=True

In [ ]:
titanic_df.sort_values(by="Pclass", ascending=False)

In [ ]:
titanic_df.head()

In [52]:
# 두 개의 컬럼을 추출하는데 정렬 컬럼 하나만 지정하기
# 원본데이터프레임 이름[["컬럼1, 컬럼2"]].sort_values(by=정렬기준칼럼)

titanic_df[["Name", "Age"]].sort_values(by="Age")

                                         Name   Age
803           Thomas, Master. Assad Alexander  0.42
755                 Hamalainen, Master. Viljo  0.67
644                    Baclini, Miss. Eugenie  0.75
469             Baclini, Miss. Helene Barbara  0.75
78              Caldwell, Master. Alden Gates  0.83
..                                        ...   ...
859                          Razi, Mr. Raihed   NaN
863         Sage, Miss. Dorothy Edith "Dolly"   NaN
868               van Melkebeke, Mr. Philemon   NaN
878                        Laleff, Mr. Kristo   NaN
888  Johnston, Miss. Catherine Helen "Carrie"   NaN

[891 rows x 2 columns]

In [54]:
#titanic_df[["Name", "Age"]].sort_values(by="Age",ascending=False)

In [55]:
# 세 개의 컬럼을 추출하는데 정렬 컬럼 두개만 지정하기
# 원본데이터프레임 이름[["컬럼1, 컬럼2","컬럼3"]].sort_values(by=["정렬기준칼럼1", "정렬기준칼럼2"])
#"정렬기준칼럼1"으로 grouping 한 후 "정렬기준컬럼2"으로 정렬함
titanic_df[["Name", "Age", "Pclass"]].sort_values(by=["Pclass", "Age"])

                                         Name    Age  Pclass
305            Allison, Master. Hudson Trevor   0.92       1
297              Allison, Miss. Helen Loraine   2.00       1
445                 Dodge, Master. Washington   4.00       1
802       Carter, Master. William Thornton II  11.00       1
435                 Carter, Miss. Lucile Polk  14.00       1
..                                        ...    ...     ...
859                          Razi, Mr. Raihed    NaN       3
863         Sage, Miss. Dorothy Edith "Dolly"    NaN       3
868               van Melkebeke, Mr. Philemon    NaN       3
878                        Laleff, Mr. Kristo    NaN       3
888  Johnston, Miss. Catherine Helen "Carrie"    NaN       3

[891 rows x 3 columns]

* DataFrame / list / dictionary / np.ndarray 서로 변환하기

In [60]:
titanic_df[["Name", "Age","Pclass"]].sort_values(by=["Pclass","Age"], ascending=[False, False])
titanic_df[["Name", "Age","Pclass"]].sort_values(by=["Pclass","Age"], ascending=[True, False])
titanic_df[["Name", "Age","Pclass"]].sort_values(by=["Pclass","Age"], ascending=[False, True])
titanic_df[["Name", "Age","Pclass"]].sort_values(by=["Pclass","Age"], ascending=[True, True])

                                         Name    Age  Pclass
305            Allison, Master. Hudson Trevor   0.92       1
297              Allison, Miss. Helen Loraine   2.00       1
445                 Dodge, Master. Washington   4.00       1
802       Carter, Master. William Thornton II  11.00       1
435                 Carter, Miss. Lucile Polk  14.00       1
..                                        ...    ...     ...
859                          Razi, Mr. Raihed    NaN       3
863         Sage, Miss. Dorothy Edith "Dolly"    NaN       3
868               van Melkebeke, Mr. Philemon    NaN       3
878                        Laleff, Mr. Kristo    NaN       3
888  Johnston, Miss. Catherine Helen "Carrie"    NaN       3

[891 rows x 3 columns]

In [64]:
# list - > ndarray -> DataFrame
import numpy as np
col_name1 = ["col1"]
list1 = [1 ,2 ,3 ,4 ,5]
array1 = np.array(list1)
print("array1 :\n", array1)
print("array1.shape :\n", array1.shape)

# 1차원 리스트를 DataFrame으로 변환하기
list1_df = pd.DataFrame(list1,columns=col_name1)
list1_df

# 1차원 리스트를 DataFrame으로 변환하기
array1_df = pd.DataFrame(array1, columns=col_name1)
array1_df

array1 :
 [1 2 3 4 5]
array1.shape :
 (5,)

   col1
0     1
1     2
2     3
3     4
4     5

In [66]:
# 2행 X 3열 의 리스트와 ndarray 를 DataFrame으로 변환하기
col_name2 = ["col1", "col2", "col3"]

list2 = [[1 ,2 ,3],
        [11 ,22 ,33]]
array2 = np.array(list2)

list2_df = pd.DataFrame(list2, columns=col_name2)
list2_df

# 2차원 ndarray 를 DataFrame 으로 변환하기
array2_df = pd.DataFrame(list2, columns=col_name2)
array2_df

   col1  col2  col3
0     1     2     3
1    11    22    33

In [67]:
dict1 = {"이름":["글로벌","아이티", "개발원"],
         "나이":[26, 21, 32],
        "성별": ["남자", "여자", "남자"]
         }

pd.DataFrame(dict1)

    이름  나이  성별
0  글로벌  26  남자
1  아이티  21  여자
2  개발원  32  남자

* DataFrame 을 ndarray로 변환하기

In [68]:
df_array = dict1_df.values
print("df_array 타입 :", type(df_array))
print("df_array :\n", df_array)

NameError: name 'dict1_df' is not defined

* DataFrame 을 list / dictionary로 변환하기

In [69]:
df_list = dict1_df.values.tolist()
print("df_list 타입 :", type(df_list))
print("df_list :\n", df_list)

NameError: name 'dict1_df' is not defined